CREATE TABLE toyy
  (
    numb CHAR(4) NOT NULL,
    name CHAR(60),
    prce INT,
    qntt INT,
    stat CHAR(6),
    kind CHAR(1),
    PRIMARY KEY (numb)
  );

INSERT INTO toyy
  VALUES
    ('1111', '자전거', 500, 3, '보유', 'T'),
    ('1112', '퍼즐세트', 300, 10, '대여', 'E'),
    ('1113', '소방차', 200, 1200, '보유', 'T'),
    ('1114', '목마', 700, 12, '보유', 'T'),
    ('1115', '흔들의자', 800, 25, '보유', 'T'),
    ('1116', '한글놀이세트', 100, 2000, '대여', 'E'),
    ('1117', '블럭맞추기', 150, 300, '대여', 'E'),
    ('1118', '미니드론', 1200, 20, '보유', 'E'),
    ('1119', '소꿉놀이세트', 1500, 10, '보유', 'T');