CREATE TABLE code
(
  cod1 CHAR(2) NOT NULL,
  cod2 CHAR(2) NOT NULL,
  name CHAR(60),
  used CHAR(1),
  PRIMARY KEY (cod1, cod2)
);

INSERT INTO code (cod1, cod2, name, used)
VALUES ('11', '11', '사장', 'Y'),
       ('11', '12', '임원', 'Y'),
       ('11', '13', '부장', 'Y'),
       ('11', '14', '차장', 'Y'),
       ('11', '15', '과장', 'Y'),
       ('11', '16', '대리', 'Y'),
       ('11', '17', '사원', 'Y'),
       ('12', 'EA', '개', 'Y'),
       ('12', 'ST', '세트', 'Y'),
       ('12', 'BX', '박스', 'Y'),
       ('12', 'KG', '킬로그램', 'Y'),
       ('12', 'LT', '리터', 'Y'),
       ('12', 'RL', '롤', 'Y'),
       ('13', '11', '서울', 'Y'),
       ('13', '12', '부산', 'Y'),
       ('13', '13', '대구', 'Y'),
       ('13', '14', '인천', 'Y'),
       ('13', '15', '울산', 'Y'),
       ('13', '16', '대전', 'Y'),
       ('13', '17', '광주', 'Y'),
       ('13', '18', '경기도', 'Y'),
       ('13', '19', '강원도', 'Y');

INSERT INTO code (cod1, cod2, name, used)
VALUES ('13', '20', '충청도', 'Y'),
       ('13', '21', '경상도', 'Y'),
       ('13', '22', '제주도', 'Y');