-- 차계부 관리 (carr)
  -- 발생순번 (numb)
  -- 발생일자 (date)
  -- 발생내역 (cont)
  -- 비용 (cost)
  -- 발생장소 (plce)
  -- 비용구분 (kind)

-- carr 테이블 생성
CREATE TABLE carr
  (
    numb INT AUTO_INCREMENT,
    date CHAR(10),
    cont CHAR(60),
    cost INT,
    plce CHAR(30),
    kind CHAR(1),
    PRIMARY KEY(numb)
  );

-- 레코드 입력
-- 자동증가값 numb 는 빼고 입력한다
INSERT INTO carr (date, cont, cost, plce, kind)
  VALUES 
  ('2020-12-30', '부동액 교체', 30000, '송정카센터', 'R'),  
  ('2020-01-05', '보험료 납부', 310000, '현대해상', 'I'),
  ('2020-01-05', '광안대교 통행료', 1000, '광안대교', 'T'),
  ('2020-01-04', '실내등 교체', 6000, '달맞이카센터', 'R'),
  ('2020-01-04', '범퍼 교체', 250000, '달맞이카센터', 'R'),
  ('2020-01-04', '타이어 펑크', 5000, '달맞이카센터', 'R'),
  ('2020-01-07', '전조등 수리', 12000, '동네카센터', 'R'),
  ('2020-01-07', '브레이크 라이닝', 30000, '동네카센터', 'R'),
  ('2020-01-07', '세정액 보충', 5000, '동네카센터', 'R');